googlereviews/app/controllers/googlereviews_controller.rb

  def index
    @googlereviews = Googlereview.all
---
SELECT "googlereviews".* FROM "googlereviews"

  def create
    @googlereview = Googlereview.new(googlereview_params)

    if @googlereview.save
---
INSERT INTO "googlereviews" ("title", "author", "review", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Live Free or Die"], ["author", "Paul"], ["review", ""], ["rating", "4"], ["created_at", "2019-10-13 19:43:55.327009"], ["updated_at", "2019-10-13 19:43:55.327009"]]

  def update
    if @googlereview.update(googlereview_params)
---
UPDATE "googlereviews" SET "title" = $1, "review" = $2, "updated_at" = $3 WHERE "googlereviews"."id" = $4  [["title", "Halo"], ["review", "Lets Roll"], ["updated_at", "2019-10-19 15:49:22.942828"], ["id", 39]]

  def destroy
    @googlereview.destroy
---
DELETE FROM "googlereviews" WHERE "googlereviews"."id" = $1  [["id", 1]]

    def set_googlereview
      @googlereview = Googlereview.find(params[:id])
---
SELECT "googlereviews".* FROM "googlereviews" WHERE "googlereviews"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]